{"zonetransfer":0,"zoneid":1,"releasing":2,"vllm":3,"releases":4,"offer":5,"reliable":6,"version":7,"code":8,"base":9,"packaged":10,"binary":11,"format":12,"can":13,"conveniently":14,"accessed":15,"via":16,"pypi":17,"also":18,"serve":19,"key":20,"milestones":21,"development":22,"team":23,"communicate":24,"community":25,"about":26,"newly":27,"available":28,"features":29,"improvements":30,"upcoming":31,"changes":32,"could":33,"affect":34,"users":35,"including":36,"potential":37,"breaking":38,"release":39,"versioning":40,"uses":41,"right":42,"shifted":43,"scheme":44,"where":45,"new":46,"patch":47,"out":48,"every":49,"weeks":50,"contain":51,"bug":52,"fixes":53,"opposed":54,"semver":55,"contains":56,"only":57,"backwards":58,"compatible":59,"when":60,"critical":61,"need":62,"made":63,"special":64,"post1":65,"released":66,"_major_":67,"major":68,"architectural":69,"milestone":70,"incompatible":71,"api":72,"similar":73,"pytorch":74,"_minor_":75,"_patch_":76,"_post1_":77,"_patch":78,"1_":79,"either":80,"explicit":81,"implicit":82,"post":83,"cadence":84,"bi":85,"weekly":86,"basis":87,"days":88,"after":89,"same":90,"branch":91,"following":92,"year":93,"2025":94,"all":95,"future":96,"dates":97,"below":98,"tentative":99,"please":100,"note":101,"optional":102,"date":103,"versions":104,"jan":105,"feb":106,"mar":107,"apr":108,"may":109,"jun":110,"10":111,"11":112,"jul":113,"12":114,"13":115,"aug":116,"14":117,"15":118,"sep":119,"16":120,"17":121,"oct":122,"18":123,"19":124,"nov":125,"20":126,"21":127,"dec":128,"22":129,"23":130,"each":131,"built":132,"from":133,"dedicated":134,"cut":135,"performed":136,"before":137,"live":138,"previously":139,"reused":140,"builds":141,"triggered":142,"push":143,"rc":144,"tag":145,"like":146,"vx":147,"rc1":148,"enables":149,"us":150,"build":151,"test":152,"multiple":153,"rcs":154,"final":155,"does":156,"trigger":157,"used":158,"notes":159,"assets":160,"created":161,"we":162,"monitor":163,"main":164,"any":165,"reverts":166,"apply":167,"cherry":168,"pick":169,"criteria":170,"approach":171,"finalizing":172,"clear":173,"what":174,"picks":175,"allowed":176,"process":177,"land":178,"pr":179,"typically":180,"limited":181,"ensure":182,"has":183,"sufficient":184,"time":185,"complete":186,"thorough":187,"round":188,"testing":189,"stable":190,"regression":191,"address":192,"functional":193,"performance":194,"against":195,"most":196,"recent":197,"severe":198,"issue":199,"silent":200,"incorrectness":201,"compatibility":202,"crashes":203,"deadlocks":204,"large":205,"memory":206,"leaks":207,"introduced":208,"documentation":209,"specific":210,"change":211,"identifiers":212,"ci":213,"feature":214,"work":215,"prs":216,"considered":217,"merged":218,"trunk":219,"exception":220,"manual":221,"validations":222,"e2e":223,"validation":224,"perform":225,"end":226,"regressions":227,"benchmark":228,"workflow":229,"https":230,"github":231,"com":232,"integration":233,"actions":234,"workflows":235,"yml":236,"current":237,"coverage":238,"models":239,"llama3":240,"llama4":241,"mixtral":242,"hardware":243,"nvidia":244,"h100":245,"amd":246,"mi300x":247,"_note":248,"based":249,"model":250,"availability_":251,"step":252,"get":253,"access":254,"request":255,"write":256,"repository":257,"run":258,"review":259,"setup":260,"familiarize":261,"yourself":262,"configurations":263,"cuda":264,"tree":265,"benchmarks":266,"rocm":267,"navigate":268,"configure":269,"set":270,"v0":271,"commit":272,"hash":273,"results":274,"once":275,"completes":276,"dashboard":277,"hud":278,"org":279,"llms":280,"reponame":281,"project":282,"2fvllm":283,"under":284,"corresponding":285,"comparison":286,"compare":287,"previous":288,"verify":289,"have":290,"occurred":291,"here":292,"example":293,"vs":294,"starttime":295,"thu":296,"2c":297,"2017":298,"20apr":299,"202025":300,"2021":301,"3a43":302,"3a50":303,"20gmt":304,"stoptime":305,"wed":306,"2016":307,"20jul":308,"granularity":309,"week":310,"lbranch":311,"lcommit":312,"b6553be1bc75f046b00046a4ad":313,"7576364d03c835":314,"rbranch":315,"rcommit":316,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":317,"benchmarkname":318,"modelname":319,"20models":320,"backendname":321,"20backends":322,"modename":323,"20modes":324,"dtypename":325,"20dtype":326,"devicename":327,"20devices":328,"archname":329,"20platforms":330,"developer":331,"certificate":332,"origin":333,"copyright":334,"2004":335,"2006":336,"linux":337,"foundation":338,"its":339,"contributors":340,"everyone":341,"permitted":342,"copy":343,"distribute":344,"verbatim":345,"copies":346,"license":347,"document":348,"changing":349,"making":350,"contribution":351,"certify":352,"whole":353,"part":354,"me":355,"submit":356,"open":357,"source":358,"indicated":359,"file":360,"upon":361,"best":362,"my":363,"knowledge":364,"covered":365,"appropriate":366,"modifications":367,"whether":368,"unless":369,"am":370,"different":371,"provided":372,"directly":373,"some":374,"other":375,"person":376,"who":377,"certified":378,"modified":379,"understand":380,"agree":381,"public":382,"record":383,"personal":384,"information":385,"sign":386,"off":387,"maintained":388,"indefinitely":389,"redistributed":390,"consistent":391,"involved":392,"read":393,"docs":394,"configuration":395,"see":396,"readthedocs":397,"io":398,"en":399,"config":400,"v2":401,"html":402,"details":403,"os":404,"ubuntu":405,"04":406,"tools":407,"python":408,"jobs":409,"post_checkout":410,"git":411,"fetch":412,"unshallow":413,"true":414,"mkdocs":415,"yaml":416,"optionally":417,"declare":418,"requirements":419,"required":420,"your":421,"install":422,"txt":423,"spdx":424,"identifier":425,"apache":426,"filecopyrighttext":427,"import":428,"importlib":429,"traceback":430,"typing":431,"callable":432,"unittest":433,"mock":434,"def":435,"find_cuda_init":436,"fn":437,"object":438,"none":439,"helper":440,"function":441,"debug":442,"re":443,"initialization":444,"errors":445,"initializes":446,"prints":447,"stack":448,"trace":449,"how":450,"happens":451,"torch":452,"_lazy_init":453,"wrapper":454,"nonlocal":455,"extract_stack":456,"return":457,"print":458,"initialized":459,"join":460,"format_list":461,"strip":462,"__name__":463,"__main__":464,"lambda":465,"import_module":466,"model_executor":467,"llava":468,"collect_env":469,"py":470,"referrerurl":471,"wsl":472,"localhost":473,"home":474,"nacho":475,"42":476,"rag":477,"zip":478,"bin":479,"bash":480,"echo":481,"linting":482,"system":483,"been":484,"moved":485,"sh":486,"pre":487,"hooks":488,"pip":489,"lint":490,"followed":491,"linters":492,"automatically":493,"site_name":494,"site_url":495,"env":496,"readthedocs_canonical_url":497,"repo_url":498,"edit_uri":499,"edit":500,"exclude_docs":501,"argparse":502,"inc":503,"md":504,"template":505,"theme":506,"name":507,"material":508,"logo":509,"logos":510,"light":511,"ico":512,"favicon":513,"palette":514,"toggle":515,"automatic":516,"mode":517,"media":518,"prefers":519,"color":520,"icon":521,"brightness":522,"auto":523,"switch":524,"default":525,"primary":526,"white":527,"dark":528,"slate":529,"black":530,"preference":531,"content":532,"action":533,"tabs":534,"link":535,"navigation":536,"instant":537,"progress":538,"tracking":539,"sticky":540,"sections":541,"indexes":542,"top":543,"search":544,"highlight":545,"share":546,"toc":547,"follow":548,"custom_dir":549,"overrides":550,"remove_announcement":551,"generate_examples":552,"generate_argparse":553,"url_schemes":554,"plugins":555,"meta":556,"autorefs":557,"awesome":558,"nav":559,"glightbox":560,"revision":561,"localized":562,"exclude":563,"autogenerated":564,"files":565,"examples":566,"minify":567,"minify_html":568,"minify_js":569,"minify_css":570,"cache_safe":571,"js_files":572,"javascript":573,"js":574,"css_files":575,"stylesheets":576,"css":577,"reference":578,"generation":579,"autonav":580,"modules":581,"api_root_uri":582,"internal":583,"third_party":584,"vllm_flash_attn":585,"mkdocstrings":586,"handlers":587,"options":588,"show_symbol_type_heading":589,"show_symbol_type_toc":590,"filters":591,"summary":592,"show_if_no_docstring":593,"show_signature_annotations":594,"separate_signature":595,"show_overloads":596,"signature_crossrefs":597,"inventories":598,"objects":599,"inv":600,"extensions":601,"latest":602,"aiohttp":603,"pillow":604,"numpy":605,"doc":606,"psutil":607,"markdown_extensions":608,"attr_list":609,"md_in_html":610,"admonition":611,"pymdownx":612,"superfences":613,"tabbed":614,"slugify":615,"slugs":616,"kwds":617,"case":618,"lower":619,"alternate_style":620,"highlighting":621,"anchor_linenums":622,"line_spans":623,"__span":624,"pygments_lang_class":625,"inlinehilite":626,"snippets":627,"emoji":628,"icons":629,"emoji_index":630,"twemoji":631,"emoji_generator":632,"to_svg":633,"page":634,"sidebar":635,"permalink":636,"math":637,"rendering":638,"mdx_math":639,"enable_dollar_delimiter":640,"extra_css":641,"extra":642,"extra_javascript":643,"run_llm_widget":644,"cdn":645,"mathjax":646,"tex":647,"ams_html":648,"edit_and_feedback":649,"slack_and_forum":650,"make":651,"url":652,"rather":653,"than":654,"act":655,"dir":656,"so":657,"index":658,"generates":659,"www":660,"user":661,"guide":662,"use_directory_urls":663,"false":664,"ctypes":665,"util":666,"json":667,"logging":668,"shutil":669,"subprocess":670,"sys":671,"pathlib":672,"path":673,"which":674,"packaging":675,"parse":676,"setuptools":677,"extension":678,"command":679,"build_ext":680,"setuptools_scm":681,"get_version":682,"utils":683,"cpp_extension":684,"cuda_home":685,"rocm_home":686,"load_module_from_path":687,"module_name":688,"spec":689,"spec_from_file_location":690,"module":691,"module_from_spec":692,"loader":693,"exec_module":694,"root_dir":695,"__file__":696,"parent":697,"logger":698,"getlogger":699,"cannot":700,"envs":701,"because":702,"depends":703,"installed":704,"yet":705,"vllm_target_device":706,"platform":707,"startswith":708,"darwin":709,"cpu":710,"warning":711,"due":712,"macos":713,"elif":714,"supports":715,"building":716,"able":717,"correctly":718,"empty":719,"getenv":720,"hip":721,"fallback":722,"main_cuda_version":723,"is_sccache_available":724,"bool":725,"sccache":726,"int":727,"vllm_disable_sccache":728,"is_ccache_available":729,"ccache":730,"is_ninja_available":731,"ninja":732,"is_url_available":733,"str":734,"urllib":735,"urlopen":736,"status":737,"try":738,"except":739,"200":740,"class":741,"cmakeextension":742,"__init__":743,"self":744,"cmake_lists_dir":745,"kwa":746,"super":747,"sources":748,"py_limited_api":749,"abspath":750,"cmake_build_ext":751,"dict":752,"directories":753,"configured":754,"did_config":755,"determine":756,"number":757,"compilation":758,"nvcc":759,"compile":760,"threads":761,"compute_num_jobs":762,"num_jobs":763,"value":764,"max_jobs":765,"environment":766,"variable":767,"defined":768,"cpus":769,"info":770,"using":771,"else":772,"sched_getaffinity":773,"isn":774,"universally":775,"fall":776,"back":777,"cpu_count":778,"error":779,"len":780,"attributeerror":781,"nvcc_threads":782,"_is_cuda":783,"get_nvcc_cuda_version":784,"reduce":785,"avoid":786,"overloading":787,"max":788,"cmake":789,"single":790,"ext":791,"ve":792,"already":793,"cmakelists":794,"exit":795,"early":796,"select":797,"type":798,"optimization":799,"level":800,"default_cfg":801,"relwithdebinfo":802,"cfg":803,"cmake_build_type":804,"cmake_args":805,"dcmake_build_type":806,"dvllm_target_device":807,"verbose":808,"dcmake_verbose_makefile":809,"dcmake_c_compiler_launcher":810,"dcmake_cxx_compiler_launcher":811,"dcmake_cuda_compiler_launcher":812,"dcmake_hip_compiler_launcher":813,"pass":814,"executable":815,"find":816,"exact":817,"match":818,"dvllm_python_executable":819,"reuse":820,"dependencies":821,"subsequent":822,"calls":823,"dvllm_python_path":824,"override":825,"directory":826,"fetchcontent":827,"downloads":828,"root":829,"deps":830,"allows":831,"sharing":832,"between":833,"profiles":834,"plays":835,"more":836,"nicely":837,"fetchcontent_base_dir":838,"fc_base_dir":839,"environ":840,"dfetchcontent_base_dir":841,"parallelism":842,"tool":843,"dnvcc_threads":844,"build_tool":845,"dcmake_job_pool_compile":846,"string":847,"dcmake_job_pools":848,"whatever":849,"sure":850,"use":851,"dcmake_cuda_compiler":852,"check_call":853,"cwd":854,"build_temp":855,"build_extensions":856,"present":857,"working":858,"check_output":859,"oserror":860,"raise":861,"runtimeerror":862,"create":863,"exist":864,"exists":865,"makedirs":866,"targets":867,"target_name":868,"removeprefix":869,"append":870,"build_args":871,"target":872,"libraries":873,"proper":874,"location":875,"outdir":876,"get_ext_fullpath":877,"absolute":878,"skip":879,"continue":880,"appends":881,"prefix":882,"remove":883,"range":884,"count":885,"should":886,"actually":887,"components":888,"install_args":889,"component":890,"first":891,"standard":892,"build_lib":893,"included":894,"editable":895,"glob":896,"recursive":897,"dst_file":898,"split":899,"copying":900,"dirname":901,"exist_ok":902,"copy_file":903,"precompiled_build_ext":904,"disables":905,"precompiled":906,"binaries":907,"assert":908,"vllm_use_precompiled":909,"supported":910,"skipping":911,"precompiled_wheel_utils":912,"extracts":913,"existing":914,"wheel":915,"staticmethod":916,"extract_precompiled_and_patch_package":917,"wheel_url_or_path":918,"tempfile":919,"zipfile":920,"temp_dir":921,"isfile":922,"wheel_filename":923,"mkdtemp":924,"wheels":925,"wheel_path":926,"downloading":927,"urlretrieve":928,"filename":929,"package_data_patch":930,"files_to_copy":931,"_c":932,"abi3":933,"_moe_c":934,"_flashmla_c":935,"_vllm_fa2_c":936,"_vllm_fa3_c":937,"cumem_allocator":938,"compiled_regex":939,"file_members":940,"list":941,"filter":942,"filelist":943,"extract":944,"target_path":945,"src":946,"target_pa":947,"th":948,"wb":949,"dst":950,"copyfileobj":951,"pkg":952,"replace":953,"setdefault":954,"basename":955,"finally":956,"removing":957,"temporary":958,"rmtree":959,"get_base_commit_in_main_branch":960,"force":961,"nightly":962,"mainly":963,"vllm_test_use_precompiled_nightly_wheel":964,"upstream":965,"resp_json":966,"curl":967,"repos":968,"commits":969,"decode":970,"utf":971,"upstream_main_commit":972,"loads":973,"sha":974,"docker":975,"context":976,"immutable":977,"missing":978,"vllm_docker_build_context":979,"check":980,"local":981,"repo":982,"cat":983,"calledprocesserror":984,"remote":985,"update":986,"branches":987,"ensures":988,"ref":989,"history":990,"our":991,"current_branch":992,"show":993,"base_commit":994,"merge":995,"valueerror":996,"err":997,"ailed":998,"dev":999,"_no_device":1000,"has_cuda":1001,"_is_neuron":1002,"_is_tpu":1003,"_is_hip":1004,"neuron":1005,"tpu":1006,"_is_cpu":1007,"_is_xpu":1008,"xpu":1009,"_build_custom_ops":1010,"get_rocm_version":1011,"librocm":1012,"core":1013,"blob":1014,"d11f5c20d500f729c393680a01fa902ebf92094b":1015,"rocm_version":1016,"cpp":1017,"l21":1018,"librocm_core_file":1019,"lib":1020,"is_file":1021,"librocm_core":1022,"cdll":1023,"vererrors":1024,"c_uint32":1025,"get_rocm_core_version":1026,"getrocmversion":1027,"restype":1028,"argtypes":1029,"pointer":1030,"minor":1031,"byref":1032,"get_neuronxcc_version":1033,"sysconfig":1034,"site_dir":1035,"get_paths":1036,"purelib":1037,"version_file":1038,"neuronxcc":1039,"executed":1040,"successfully":1041,"fp":1042,"regular":1043,"expression":1044,"__version__":1045,"group":1046,"output":1047,"adapted":1048,"apex":1049,"8b7a1ff183741dd8f9b87e7bafd04cfde99cea28":1050,"nvcc_output":1051,"universal_newlines":1052,"release_idx":1053,"nvcc_cuda_version":1054,"get_gaudi_sw_version":1055,"returns":1056,"driver":1057,"enable":1058,"console":1059,"printing":1060,"hl":1061,"smi":1062,"shell":1063,"text":1064,"capture_output":1065,"enable_console":1066,"returncode":1067,"stdout":1068,"get_vllm_version":1069,"write_to":1070,"_version":1071,"might":1072,"cuda_version":1073,"cuda_version_str":1074,"tarball":1075,"sdist":1076,"argv":1077,"cu":1078,"neuron_version":1079,"neuron_version_str":1080,"unknown":1081,"runtime":1082,"get_requirements":1083,"package":1084,"requirements_dir":1085,"_read_requirements":1086,"resolved_requirements":1087,"line":1088,"common":1089,"cuda_major":1090,"cuda_minor":1091,"modified_requirements":1092,"req":1093,"flash":1094,"attn":1095,"unsupported":1096,"ext_modules":1097,"_rocm_c":1098,"fa3":1099,"requires":1100,"later":1101,"since":1102,"doesn":1103,"produce":1104,"targeting":1105,"hopper":1106,"package_data":1107,"typed":1108,"layers":1109,"fused_moe":1110,"configs":1111,"quantization":1112,"advance":1113,"wheel_location":1114,"vllm_precompiled_wheel_location":1115,"wheel_url":1116,"ai":1117,"cp38":1118,"manylinux1_x86_64":1119,"whl":1120,"resp":1121,"warn":1122,"falling":1123,"items":1124,"extend":1125,"cmdclass":1126,"cmd":1127,"static":1128,"metadata":1129,"go":1130,"pyproject":1131,"toml":1132,"install_requires":1133,"extras_require":1134,"bench":1135,"pandas":1136,"datasets":1137,"tensorizer":1138,"fastsafetensors":1139,"runai":1140,"streamer":1141,"s3":1142,"boto3":1143,"audio":1144,"librosa":1145,"soundfile":1146,"mistral_common":1147,"processing":1148,"video":1149,"kept":1150,"flashinfer":1151,"updated":1152,"together":1153,"dockerfile":1154,"cmake_minimum_required":1155,"26":1156,"you":1157,"places":1158,"correct":1159,"mkdir":1160,"cd":1161,"python3":1162,"dcmake_install_prefix":1163,"want":1164,"one":1165,"manually":1166,"vllm_extensions":1167,"languages":1168,"cxx":1169,"overridden":1170,"cache":1171,"device":1172,"backend":1173,"message":1174,"include":1175,"cmake_current_list_dir":1176,"suppress":1177,"warnings":1178,"unused":1179,"specified":1180,"variables":1181,"ignoreme":1182,"vllm_python_path":1183,"prevent":1184,"installation":1185,"cutlass":1186,"cmake_install_local_only":1187,"all_components":1188,"searched":1189,"order":1190,"selected":1191,"sync":1192,"python_supported_versions":1193,"gpu":1194,"architectures":1195,"hip_supported_archs":1196,"gfx906":1197,"gfx908":1198,"gfx90a":1199,"gfx942":1200,"gfx950":1201,"gfx1030":1202,"gfx1100":1203,"gfx1101":1204,"gfx1200":1205,"gfx1201":1206,"expected":1207,"currently":1208,"having":1209,"incorrect":1210,"derived":1211,"various":1212,"torch_supported_version_cuda":1213,"torch_supported_version_rocm":1214,"exactly":1215,"matches":1216,"vllm_python_executable":1217,"find_python_from_executable":1218,"fatal_error":1219,"desired":1220,"running":1221,"endif":1222,"cmake_prefix_path":1223,"append_cmake_prefix_path":1224,"find_program":1225,"nvcc_executable":1226,"cuda_found":1227,"found":1228,"imports":1229,"partially":1230,"customizations":1231,"do":1232,"explicitly":1233,"check_language":1234,"enable_language":1235,"etc":1236,"find_package":1237,"must":1238,"happen":1239,"cmake_cuda_compiler_version":1240,"gets":1241,"version_greater_equal":1242,"cuda_supported_archs":1243,"forward":1244,"non":1245,"external":1246,"scripts":1247,"strequal":1248,"cpu_extension":1249,"up":1250,"language":1251,"hip_found":1252,"vllm_gpu_lang":1253,"torch_version":1254,"version_equal":1255,"saw":1256,"instead":1257,"elseif":1258,"importing":1259,"recogni":1260,"zes":1261,"sets":1262,"let":1263,"recognize":1264,"enabled":1265,"rocm_version_dev_major":1266,"greater_equal":1267,"control":1268,"per":1269,"down":1270,"cmake_cuda_flags":1271,"applied":1272,"globally":1273,"clear_cuda_arches":1274,"cuda_arch_flags":1275,"extract_unique_cuda_archs_ascending":1276,"cuda_archs":1277,"archs":1278,"cuda_archs_loose_intersection":1279,"detected":1280,"them":1281,"arches":1282,"stored":1283,"vllm_gpu_arches":1284,"override_gpu_arches":1285,"_supported_archs":1286,"query":1287,"additional":1288,"flags":1289,"given":1290,"vllm_gpu_flags":1291,"get_torch_gpu_compiler_flags":1292,"stre":1293,"qual":1294,"compiled":1295,"play":1296,"dependency":1297,"produces":1298,"artifacts":1299,"binary_dir":1300,"conflicts":1301,"types":1302,"cmake_binary_dir":1303,"make_directory":1304,"overriding":1305,"adding":1306,"ggdb3":1307,"devug":1308,"cmake_":1309,"_flags_debug":1310,"o0":1311,"cmake_cxx_flags_debug":1312,"certain":1313,"functions":1314,"marked":1315,"nodiscard":1316,"ignores":1317,"result":1318,"lot":1319,"always":1320,"mask":1321,"real":1322,"issues":1323,"suppressing":1324,"until":1325,"properly":1326,"addressed":1327,"_flags":1328,"wno":1329,"cmake_cxx_flags":1330,"define":1331,"vllm_cumem_ext_src":1332,"csrc":1333,"set_gencode_flags_for_srcs":1334,"srcs":1335,"enabling":1336,"cumem":1337,"allocator":1338,"library":1339,"cumem_libs":1340,"cuda_driver":1341,"define_gpu_extension_target":1342,"destination":1343,"use_sabi":1344,"with_soabi":1345,"vllm_ext_src":1346,"mamba":1347,"mamba_ssm":1348,"selective_scan_fwd":1349,"cache_kernels":1350,"attention":1351,"paged_attention_v1":1352,"paged_attention_v2":1353,"merge_attn_states":1354,"vertical_slash_index":1355,"pos_encoding_kernels":1356,"activation_kernels":1357,"layernorm_kernels":1358,"layernorm_quant_kernels":1359,"sampler":1360,"cuda_view":1361,"gptq":1362,"q_gemm":1363,"compressed_tensors":1364,"int8_quant_kernels":1365,"fp8":1366,"fused_kernels":1367,"fused_layernorm_dynamic_per_token_quant":1368,"gguf":1369,"gguf_kernel":1370,"cuda_utils_kernels":1371,"custom_all_reduce":1372,"torch_bindings":1373,"cutlass_enable_headers_only":1374,"header":1375,"cutlass_revision":1376,"bogus":1377,"messages":1378,"v4":1379,"vllm_cutlass_src_dir":1380,"is_absolute":1381,"get_filename_component":1382,"fetchcontent_declare":1383,"source_dir":1384,"git_repository":1385,"keep":1386,"above":1387,"git_tag":1388,"git_progress":1389,"speed":1390,"download":1391,"retrieving":1392,"important":1393,"git_shallow":1394,"works":1395,"names":1396,"tags":1397,"pdated":1398,"fetchcontent_makeavailable":1399,"awq":1400,"gemm_kernels":1401,"permute_cols":1402,"cutlass_w8a8":1403,"scaled_mm_entry":1404,"fp4":1405,"nvfp4_quant_entry":1406,"nvfp4_scaled_mm_entry":1407,"nvfp4_blockwise_moe_kernel":1408,"sparse":1409,"sparse_scaled_mm_entry":1410,"cutlass_extensions":1411,"mla":1412,"cutlass_mla_entry":1413,"per_token_group_quant":1414,"marlin":1415,"kernels":1416,"least":1417,"sizes":1418,"shapes":1419,"machete":1420,"bf16":1421,"atomicadd":1422,"ptx":1423,"marlin_archs":1424,"generate":1425,"preselected":1426,"input":1427,"pairs":1428,"schedules":1429,"marlin_gen_script":1430,"cmake_current_source_dir":1431,"gptq_marlin":1432,"generate_kernels":1433,"md5":1434,"marlin_gen_script_hash":1435,"script":1436,"last":1437,"execute_process":1438,"cmake_command":1439,"pythonpath":1440,"python_executable":1441,"result_variable":1442,"marlin_generation_result":1443,"output_variable":1444,"output_file":1445,"cmake_current_binary_dir":1446,"ma":1447,"rlin_generation":1448,"log":1449,"error_file":1450,"marlin_generation":1451,"equal":1452,"failed":1453,"ncheck":1454,"completed":1455,"changed":1456,"marlin_template_kernel_src":1457,"kernel_":1458,"set_source_files_properties":1459,"properties":1460,"compile_flags":1461,"global":1462,"stub":1463,"marlin_srcs":1464,"dense":1465,"marlin_cuda_kernel":1466,"marlin_24_cuda_kernel":1467,"qqq":1468,"marlin_qqq_gemm_kernel":1469,"gptq_marlin_repack":1470,"awq_marlin_repack":1471,"tatus":1472,"allspark":1473,"allspark_archs":1474,"allspark_srcs":1475,"gptq_allspark":1476,"allspark_repack":1477,"allspark_qgemm_w8a16":1478,"scaled_mm_3x_archs":1479,"cutlass_scaled_mm":1480,"c3x":1481,"require":1482,"scaled_mm_archs":1483,"0a":1484,"scaled_mm_c3x_sm90":1485,"scaled_mm_sm90_fp8":1486,"scaled_mm_sm90_int8":1487,"scaled_mm_azp_sm90_int8":1488,"scaled_mm_blockwise_sm90_fp8":1489,"denable_scaled_mm_sm90":1490,"scaled_mm_c2x":1491,"know":1492,"cmake_cuda_co":1493,"mpiler_version":1494,"compiler":1495,"recommend":1496,"upgrading":1497,"intend":1498,"quantized":1499,"geforce":1500,"blackwell":1501,"sm120":1502,"scaled_mm_c3x_sm120":1503,"scaled_mm_sm120_fp8":1504,"scaled_mm_blockwise_sm120_fp8":1505,"denable_scaled_mm_sm120":1506,"scaled_mm_c3x_120":1507,"blackw":1508,"ell":1509,"sm100":1510,"1a":1511,"scaled_mm_c3x_sm100":1512,"scaled_mm_sm100_fp8":1513,"scaled_mm_blockwise_sm100_fp8":1514,"denable_scaled_mm_sm100":1515,"scaled_mm_c3x_100":1516,"c2x":1517,"remaining":1518,"3x":1519,"scaled_mm_2x_archs":1520,"subtract":1521,"remove_item":1522,"denable_scaled_mm_c2x":1523,"scaled_mm_c3x":1524,"cutlass_scaled_sparse_mm":1525,"cutlass_compressor":1526,"sparse_scaled_mm_c3x":1527,"denable_sparse_scaled_mm_c3x":1528,"nvfp4_scaled_mm_sm120":1529,"fp4_archs":1530,"nvfp4_quant_kernels":1531,"nvfp4_scaled_mm_sm120_kernels":1532,"denable_nvfp4_sm120":1533,"nvfp4":1534,"were":1535,"nvfp4_experts_quant":1536,"nvfp4_scaled_mm_kernels":1537,"denable_nvfp4_sm100":1538,"denable_cutlass_moe_sm100":1539,"mla_archs":1540,"cutlass_mla_kernels":1541,"sm100_cutlass_mla_kernel":1542,"denable_cutlass_mla":1543,"add":1544,"include_directories":1545,"cutlass_dir":1546,"77_blackwell_fmha":1547,"ssage":1548,"moe":1549,"kernel":1550,"cutlass_moe_mm":1551,"get_cutlass_":1552,"pplx_":1553,"moe_mm_data":1554,"possible":1555,"grouped_mm_c3x_sm90":1556,"denable_cutlass_moe_sm90":1557,"grouped_mm_c3x":1558,"grouped_mm_c3x_sm100":1559,"cuda_compiler_version":1560,"moe_data":1561,"cutlass_moe_data_archs":1562,"blockwise_scaled_group_mm_sm100":1563,"blo":1564,"ckwise_scaled_group_mm_sm100":1565,"something":1566,"sm90a":1567,"machete_archs":1568,"machete_gen_script":1569,"machete_gen_script_hash":1570,"machete_generation_result":1571,"machete_generation_output":1572,"machete_generation":1573,"lo":1574,"generated":1575,"machete_gen_sources":1576,"machete_pytorch":1577,"w4a16":1578,"quickreduce":1579,"custom_quickreduce":1580,"des":1581,"tination":1582,"cutlass_include_dir":1583,"cutlass_tools_util_include_dir":1584,"cudagetdriverentrypointbyversion":1585,"calling":1586,"causes":1587,"problems":1588,"linking":1589,"earlier":1590,"setting":1591,"sidesteps":1592,"target_compile_definitions":1593,"private":1594,"cutlass_enable_direct_cuda_driver_call":1595,"vllm_moe_ext_src":1596,"moe_align_sum_kernels":1597,"topk_softmax_kernels":1598,"moe_wna16":1599,"moe_permute_src":1600,"permute_unpermute_kernels":1601,"moe_permute_unpermute_kernel":1602,"moe_permute_unpermute_op":1603,"vllm_moe_wna16_src":1604,"marlin_moe_archs":1605,"moe_marlin_gen_script":1606,"marlin_moe_wna16":1607,"moe_marlin_gen_script_hash":1608,"moe_marlin_generation_result":1609,"moe_marlin_generation_output":1610,"moe_marlin_generation":1611,"moe_wnaa16_marlin_src":1612,"foun":1613,"vllm_rocm_ext_src":1614,"skinny_gemms":1615,"ship":1616,"projects":1617,"external_projects":1618,"flashmla":1619,"overwrites":1620,"contributing":1621,"conduct":1622,"pledge":1623,"members":1624,"leaders":1625,"participation":1626,"harassment":1627,"free":1628,"experience":1629,"regardless":1630,"age":1631,"body":1632,"size":1633,"visible":1634,"invisible":1635,"disability":1636,"ethnicity":1637,"sex":1638,"characteristics":1639,"gender":1640,"identity":1641,"education":1642,"socioeconomic":1643,"nationality":1644,"appearance":1645,"race":1646,"caste":1647,"religion":1648,"sexual":1649,"orientation":1650,"interact":1651,"ways":1652,"contribute":1653,"welcoming":1654,"diverse":1655,"inclusive":1656,"healthy":1657,"standards":1658,"behavior":1659,"contributes":1660,"positive":1661,"demonstrating":1662,"empathy":1663,"kindness":1664,"toward":1665,"people":1666,"being":1667,"respectful":1668,"differing":1669,"opinions":1670,"viewpoints":1671,"experiences":1672,"giving":1673,"gracefully":1674,"accepting":1675,"constructive":1676,"feedback":1677,"responsibility":1678,"apologizing":1679,"those":1680,"affected":1681,"mistakes":1682,"learning":1683,"focusing":1684,"just":1685,"individuals":1686,"overall":1687,"unacceptable":1688,"sexualized":1689,"imagery":1690,"advances":1691,"kind":1692,"trolling":1693,"insulting":1694,"derogatory":1695,"comments":1696,"political":1697,"attacks":1698,"publishing":1699,"others":1700,"physical":1701,"email":1702,"without":1703,"permission":1704,"reasonably":1705,"inappropriate":1706,"professional":1707,"enforcement":1708,"responsibilities":1709,"responsible":1710,"clarifying":1711,"enforcing":1712,"acceptable":1713,"take":1714,"fair":1715,"corrective":1716,"response":1717,"deem":1718,"threatening":1719,"offensive":1720,"harmful":1721,"reject":1722,"wiki":1723,"edits":1724,"contributions":1725,"aligned":1726,"reasons":1727,"moderation":1728,"decisions":1729,"scope":1730,"applies":1731,"within":1732,"spaces":1733,"individual":1734,"officially":1735,"representing":1736,"official":1737,"posting":1738,"social":1739,"account":1740,"acting":1741,"appointed":1742,"representative":1743,"online":1744,"offline":1745,"irl":1746,"event":1747,"instances":1748,"abusive":1749,"harassing":1750,"otherwise":1751,"reported":1752,"channel":1753,"slack":1754,"complaints":1755,"reviewed":1756,"investigated":1757,"promptly":1758,"fairly":1759,"obligated":1760,"respect":1761,"privacy":1762,"security":1763,"reporter":1764,"incident":1765,"guidelines":1766,"impact":1767,"determining":1768,"consequences":1769,"violation":1770,"correction":1771,"deemed":1772,"unprofessional":1773,"unwelcome":1774,"consequence":1775,"written":1776,"providing":1777,"clarity":1778,"around":1779,"nature":1780,"explanation":1781,"why":1782,"apology":1783,"requested":1784,"through":1785,"series":1786,"continued":1787,"interaction":1788,"unsolicited":1789,"period":1790,"includes":1791,"avoiding":1792,"interactions":1793,"well":1794,"channels":1795,"violating":1796,"terms":1797,"lead":1798,"permanent":1799,"ban":1800,"serious":1801,"sustained":1802,"sort":1803,"communication":1804,"during":1805,"pattern":1806,"aggression":1807,"disparagement":1808,"classes":1809,"attribution":1810,"contributor":1811,"covenant":1812,"code_of_conduct":1813,"inspired":1814,"mozilla":1815,"ladder":1816,"inclusion":1817,"answers":1818,"questions":1819,"faq":1820,"translations":1821,"md007":1822,"indent":1823,"md013":1824,"md024":1825,"siblings_only":1826,"md033":1827,"md042":1828,"md045":1829,"md046":1830,"md051":1831,"md052":1832,"md053":1833,"md059":1834,"requires_files":1835,"cleaning":1836,"lines":1837,"readlines":1838,"removed":1839,"done":1840,"january":1841,"http":1842,"licenses":1843,"conditions":1844,"reproduction":1845,"distribution":1846,"definitions":1847,"shall":1848,"mean":1849,"licensor":1850,"owner":1851,"entity":1852,"authorized":1853,"granting":1854,"legal":1855,"union":1856,"entities":1857,"controlled":1858,"purposes":1859,"definition":1860,"means":1861,"power":1862,"direct":1863,"indirect":1864,"cause":1865,"direction":1866,"management":1867,"contract":1868,"ii":1869,"ownership":1870,"fifty":1871,"percent":1872,"50":1873,"outstanding":1874,"shares":1875,"iii":1876,"beneficial":1877,"exercising":1878,"permissions":1879,"granted":1880,"form":1881,"preferred":1882,"software":1883,"resulting":1884,"mechanical":1885,"transformation":1886,"translation":1887,"conversions":1888,"authorship":1889,"notice":1890,"attached":1891,"appendix":1892,"derivative":1893,"editor":1894,"ial":1895,"revisions":1896,"annotations":1897,"elaborations":1898,"represent":1899,"original":1900,"remain":1901,"separable":1902,"merely":1903,"bind":1904,"interfaces":1905,"thereof":1906,"additions":1907,"intentionally":1908,"submitted":1909,"behalf":1910,"electronic":1911,"verbal":1912,"sent":1913,"representatives":1914,"mailing":1915,"lists":1916,"systems":1917,"managed":1918,"purpose":1919,"discussing":1920,"improving":1921,"excluding":1922,"conspicuously":1923,"designated":1924,"writing":1925,"whom":1926,"received":1927,"subsequently":1928,"incorporated":1929,"grant":1930,"subject":1931,"hereby":1932,"grants":1933,"perpetual":1934,"worldwide":1935,"exclusive":1936,"charge":1937,"royalty":1938,"irrevocable":1939,"reproduce":1940,"prepare":1941,"publicly":1942,"display":1943,"sublicense":1944,"patent":1945,"thi":1946,"stated":1947,"section":1948,"sell":1949,"transfer":1950,"claims":1951,"licensable":1952,"necessarily":1953,"infringed":1954,"alone":1955,"combination":1956,"institute":1957,"litigation":1958,"cross":1959,"claim":1960,"counterclaim":1961,"lawsuit":1962,"alleging":1963,"constitutes":1964,"contributory":1965,"infringement":1966,"terminate":1967,"filed":1968,"redistribution":1969,"medium":1970,"meet":1971,"give":1972,"recipients":1973,"carry":1974,"prominent":1975,"notices":1976,"stating":1977,"retain":1978,"trademark":1979,"pertain":1980,"readable":1981,"contained":1982,"ex":1983,"cluding":1984,"distributed":1985,"along":1986,"wherever":1987,"third":1988,"party":1989,"normally":1990,"appear":1991,"contents":1992,"informational":1993,"modify":1994,"own":1995,"alongside":1996,"addendum":1997,"construed":1998,"modifying":1999,"statement":2000,"provide":2001,"complies":2002,"submission":2003,"state":2004,"notwithstanding":2005,"nothing":2006,"herein":2007,"supersede":2008,"separate":2009,"agreement":2010,"regarding":2011,"trademarks":2012,"trade":2013,"service":2014,"marks":2015,"product":2016,"reasonable":2017,"customary":2018,"describing":2019,"reproducin":2020,"disclaimer":2021,"warranty":2022,"applicable":2023,"law":2024,"agreed":2025,"provides":2026,"warranties":2027,"express":2028,"implied":2029,"limitation":2030,"title":2031,"merchantability":2032,"fitness":2033,"particular":2034,"solely":2035,"appropriateness":2036,"redistributing":2037,"assume":2038,"risks":2039,"associated":2040,"exercise":2041,"liability":2042,"theory":2043,"tort":2044,"negligence":2045,"deliberate":2046,"grossly":2047,"negligent":2048,"acts":2049,"liable":2050,"damages":2051,"incidental":2052,"consequential":2053,"character":2054,"arising":2055,"inability":2056,"loss":2057,"goodwill":2058,"stoppage":2059,"computer":2060,"failure":2061,"malfunction":2062,"commercial":2063,"losses":2064,"even":2065,"advised":2066,"possibility":2067,"while":2068,"choose":2069,"fee":2070,"acceptance":2071,"support":2072,"indemnity":2073,"obligations":2074,"rights":2075,"however":2076,"sole":2077,"indemnify":2078,"defend":2079,"hold":2080,"harmless":2081,"liabi":2082,"lity":2083,"incurred":2084,"asserted":2085,"reason":2086,"attach":2087,"boilerplate":2088,"fields":2089,"enclosed":2090,"brackets":2091,"replaced":2092,"identifying":2093,"don":2094,"comment":2095,"syntax":2096,"description":2097,"printed":2098,"easier":2099,"identification":2100,"archives":2101,"yyyy":2102,"licensed":2103,"compliance":2104,"obtain":2105,"governing":2106,"limitations":2107,"mirrored":2108,"24":2109,"77":2110,"80":2111,"scm":2112,"jinja2":2113,"build_meta":2114,"authors":2115,"readme":2116,"high":2117,"throughput":2118,"efficient":2119,"inference":2120,"serving":2121,"engine":2122,"classifiers":2123,"programming":2124,"intended":2125,"audience":2126,"developers":2127,"technology":2128,"science":2129,"research":2130,"topic":2131,"scientific":2132,"engineering":2133,"artificial":2134,"intelligence":2135,"analysis":2136,"dynamic":2137,"urls":2138,"homepage":2139,"entrypoints":2140,"cli":2141,"entry":2142,"points":2143,"general_plugins":2144,"lora_filesystem_resolver":2145,"lora_resolvers":2146,"filesystem_resolver":2147,"register_filesystem_resolver":2148,"settings":2149,"needed":2150,"presence":2151,"packages":2152,"yapfignore":2153,"ignore_patterns":2154,"buildkite":2155,"ruff":2156,"allow":2157,"long":2158,"length":2159,"f401":2160,"up006":2161,"up035":2162,"up03":2163,"executor":2164,"worker":2165,"pycodestyle":2166,"pyflakes":2167,"pyupgrade":2168,"flake8":2169,"bugbear":2170,"simplify":2171,"sim":2172,"isort":2173,"ignore":2174,"star":2175,"f405":2176,"f403":2177,"assignment":2178,"e731":2179,"loop":2180,"b007":2181,"up032":2182,"minimum":2183,"up007":2184,"mypy":2185,"pydantic":2186,"ignore_missing_imports":2187,"check_untyped_defs":2188,"follow_imports":2189,"fixing":2190,"move":2191,"adapter_commons":2192,"inputs":2193,"logging_utils":2194,"multimodal":2195,"platforms":2196,"transformers_utils":2197,"triton_utils":2198,"usage":2199,"todo":2200,"woosuk":2201,"megatron":2202,"huggingface":2203,"parallel_utils":2204,"triton":2205,"ops":2206,"skip_glob":2207,"use_parentheses":2208,"skip_gitignore":2209,"pytest":2210,"ini_options":2211,"markers":2212,"skip_global_cleanup":2213,"core_model":2214,"hybrid_model":2215,"pure":2216,"ssm":2217,"hybrid":2218,"cpu_model":2219,"tests":2220,"skip_v1":2221,"v1":2222,"ptional":2223,"skipped":2224,"ty":2225,"venv":2226,"typos":2227,"english":2228,"words":2229,"fixtures":2230,"prompts":2231,"sonnet":2232,"lora":2233,"data":2234,"hidden":2235,"dot":2236,"vcs":2237,"unicode":2238,"hex":2239,"leading":2240,"digits":2241,"locale":2242,"nvml_":2243,"unc":2244,"_thw":2245,"ue8m0":2246,"ue4m3":2247,"eles":2248,"tt":2249,"rr":2250,"bbc5b7ede":2251,"womens_doubles":2252,"v_2nd":2253,"splitted_input":2254,"noops":2255,"typ":2256,"nin_shortcut":2257,"upernetdecoder":2258,"subtile":2259,"cudadevattrmaxsharedmemoryperblockoptin":2260,"sfouput":2261,"transformers":2262,"depthwise_seperable_out_channel":2263,"depthwiseseperableconv1d":2264,"depthwise_seperable_cnn":2265,"iy":2266,"tendencias":2267,"intel":2268,"tme":2269,"dout":2270,"pn":2271,"arange":2272,"ndarray":2273,"eoferror":2274,"fo":2275,"ba":2276,"ign":2277,"ore":2278,"countr_one":2279,"k_ot":2280,"ot":2281,"rust":2282,"flate2":2283,"ser":2284,"lock":2285,"jl":2286,"modul":2287,"egals":2288,"usig":2289,"egal":2290,"flate":2291,"nd":2292,"man":2293,"cert":2294,"vimscript":2295,"identifie":2296,"rs":2297,"windo":2298,"policy":2299,"reporting":2300,"report":2301,"privately":2302,"vulnerability":2303,"advisories":2304,"triage":2305,"reports":2306,"triaged":2307,"vulnerability_management":2308,"threat":2309,"assumptions":2310,"recommendations":2311,"securely":2312,"severity":2313,"risk":2314,"taking":2315,"dealing":2316,"past":2317,"defaults":2318,"cases":2319,"categories":2320,"vulnerabilities":2321,"attackers":2322,"execute":2323,"arbitrary":2324,"full":2325,"significantly":2326,"compromise":2327,"confidentiality":2328,"integrity":2329,"availability":2330,"privileges":2331,"execution":2332,"network":2333,"deserialization":2334,"exploit":2335,"chains":2336,"generally":2337,"rated":2338,"cvss":2339,"flaws":2340,"elevated":2341,"rce":2342,"contexts":2343,"significant":2344,"advanced":2345,"trust":2346,"deployment":2347,"modes":2348,"multi":2349,"node":2350,"privileged":2351,"scores":2352,"moderate":2353,"denial":2354,"partial":2355,"disruption":2356,"breach":2357,"rating":2358,"low":2359,"disclosures":2360,"exploitable":2361,"weaknesses":2362,"privilege":2363,"negligible":2364,"side":2365,"collisions":2366,"often":2367,"less":2368,"prenotification":2369,"prenotify":2370,"organizations":2371,"vendors":2372,"coordinated":2373,"notification":2374,"contacts":2375,"advisory":2376,"few":2377,"wish":2378,"added":2379,"send":2380,"vendor":2381,"contact":2382,"analyzed":2383,"withdraw":2384,"receiving":2385,"prenotifications":2386,"membership":2387,"refinements":2388,"rules":2389,"disabled":2390,"sc1091":2391,"sourced":2392,"shellcheck":2393,"sc2004":2394,"style":2395,"unnecessary":2396,"arithmetic":2397,"sc2129":2398,"consider":2399,"cmd1":2400,"cmd2":2401,"redirects":2402,"sc2155":2403,"assign":2404,"separately":2405,"masking":2406,"values":2407,"sc2164":2408,"fails":2409,"disable":2410,"markdownlint":2411,"md001":2412,"md041":2413,"align":2414,"center":2415,"picture":2416,"srcset":2417,"raw":2418,"githubusercontent":2419,"png":2420,"img":2421,"alt":2422,"width":2423,"55":2424,"h3":2425,"easy":2426,"fast":2427,"cheap":2428,"llm":2429,"href":2430,"blog":2431,"arxiv":2432,"abs":2433,"2309":2434,"06180":2435,"paper":2436,"vllm_project":2437,"twitter":2438,"discuss":2439,"forum":2440,"news":2441,"08":2442,"hosted":2443,"beijing":2444,"meetup":2445,"mp":2446,"weixin":2447,"qq":2448,"dgkwg1wfpwgo2jcdtqqhxa":2449,"scale":2450,"slides":2451,"drive":2452,"google":2453,"folders":2454,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":2455,"recording":2456,"chaspark":2457,"1166916873711665152":2458,"05":2459,"nyc":2460,"lu":2461,"c1rqyf1f":2462,"presentation":2463,"1_q_aw_iomjwuimf1s1ym":2464,"zhjxz8cuel0ijvaquoybea":2465,"usp":2466,"now":2467,"announcement":2468,"welcomes":2469,"01":2470,"excited":2471,"announce":2472,"alpha":2473,"upgrade":2474,"7x":2475,"speedup":2476,"clean":2477,"optimized":2478,"zero":2479,"overhead":2480,"caching":2481,"enhanced":2482,"27":2483,"asia":2484,"day":2485,"sginnovate":2486,"limite":2487,"morning":2488,"evening":2489,"slots":2490,"inaugural":2491,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":2492,"03":2493,"ollama":2494,"night":2495,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":2496,"china":2497,"n77gibl2coratqhtveazfg":2498,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":2499,"east":2500,"coast":2501,"7mu4k4xx":2502,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":2503,"slide":2504,"id":2505,"g31441846c39_0_0":2506,"02":2507,"ninth":2508,"h7g3kuj9":2509,"1jzc_pzvxrvnsfvcw":2510,"v4cfxb6pn7zz2cyp_flwo05aqg":2511,"1zk5qejiktmlq2eqcxqzlljax3m9s7nwn":2512,"view":2513,"posted":2514,"eighth":2515,"zep56hui":2516,"cloud":2517,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":2518,"1h24phewanyrl11xy5dxubvrc9f9kkjix":2519,"2024":2520,"joins":2521,"ecosystem":2522,"seventh":2523,"h0qvrajz":2524,"snowflake":2525,"ogle":2526,"1e3cxqbv3jsfgp30swyvs3em_tw":2527,"ghohj9pajgk6kr54":2528,"1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a":2529,"coordinating":2530,"feel":2531,"ray":2532,"summit":2533,"held":2534,"track":2535,"opening":2536,"talk":2537,"1b_kqxphbtra_mdf":2538,"tr6i8rwdou5qotznceg2mkzxehm":2539,"learn":2540,"talks":2541,"youtube":2542,"playlist":2543,"plztswpqnepxl6aqwifuwuimlpfrvpksjr":2544,"09":2545,"sixth":2546,"87q3nvnh":2547,"1wrlgwytqfaotd5wcgspnhoaw3nq0e":2548,"9wqyp7ny93xrs":2549,"07":2550,"fifth":2551,"lp0gyjqr":2552,"aws":2553,"1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y":2554,"partnership":2555,"llama":2556,"pipeline":2557,"llama31":2558,"06":2559,"fourth":2560,"agivllm":2561,"cloudflare":2562,"bentoml":2563,"1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4":2564,"robloxandvllmmeetup2024":2565,"splashthat":2566,"roblox":2567,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":2568,"second":2569,"ygxbpzhl":2570,"ibm":2571,"ind":2572,"12mi2skabnuw5rbwxdyy":2573,"hthth4imsnceoq10jdqbxga":2574,"2023":2575,"a16z":2576,"1ql":2577,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":2578,"would":2579,"sincere":2580,"gratitude":2581,"andreessen":2582,"horowitz":2583,"30":2584,"supporting":2585,"generous":2586,"fastchat":2587,"powered":2588,"lmsys":2589,"vicuna":2590,"chatbot":2591,"arena":2592,"chat":2593,"mid":2594,"april":2595,"originally":2596,"developed":2597,"sky":2598,"computing":2599,"lab":2600,"cs":2601,"berkeley":2602,"edu":2603,"uc":2604,"evolved":2605,"driven":2606,"both":2607,"academia":2608,"industry":2609,"art":2610,"pagedattention":2611,"continuous":2612,"batching":2613,"incoming":2614,"requests":2615,"graph":2616,"quantizations":2617,"2210":2618,"17323":2619,"2306":2620,"00978":2621,"autoround":2622,"05516":2623,"int4":2624,"int8":2625,"flashattention":2626,"speculative":2627,"decoding":2628,"chunked":2629,"prefill":2630,"flexible":2631,"seamless":2632,"popular":2633,"hugging":2634,"face":2635,"algorithms":2636,"parallel":2637,"sampling":2638,"beam":2639,"tensor":2640,"expert":2641,"streaming":2642,"outputs":2643,"openai":2644,"server":2645,"gpus":2646,"powerpc":2647,"seamlessly":2648,"transformer":2649,"mixture":2650,"deepseek":2651,"v3":2652,"embedding":2653,"e5":2654,"mistral":2655,"modal":2656,"supported_models":2657,"getting":2658,"started":2659,"getting_started":2660,"visit":2661,"quickstart":2662,"welcome":2663,"collaborations":2664,"sponsors":2665,"compute":2666,"resources":2667,"thank":2668,"alphabetical":2669,"cash":2670,"donations":2671,"dropbox":2672,"sequoia":2673,"capital":2674,"skywork":2675,"zhenfund":2676,"alibaba":2677,"anyscale":2678,"crusoe":2679,"databricks":2680,"deepinfra":2681,"nebius":2682,"novita":2683,"replicate":2684,"runpod":2685,"trainy":2686,"san":2687,"diego":2688,"sponsor":2689,"fundraising":2690,"venue":2691,"opencollective":2692,"plan":2693,"fund":2694,"maintenance":2695,"adoption":2696,"citation":2697,"cite":2698,"bibtex":2699,"inproceedings":2700,"kwon2023efficient":2701,"author":2702,"kwon":2703,"zhuohan":2704,"li":2705,"siyuan":2706,"zhuang":2707,"ying":2708,"sheng":2709,"lianmin":2710,"zheng":2711,"cody":2712,"hao":2713,"yu":2714,"joseph":2715,"gonzalez":2716,"zhang":2717,"ion":2718,"stoica":2719,"booktitle":2720,"proceedings":2721,"acm":2722,"sigops":2723,"29th":2724,"symposium":2725,"operating":2726,"principles":2727,"start":2728,"technical":2729,"fellow":2730,"partnerships":2731,"mailto":2732,"kit":2733,"refer":2734,"basedonstyle":2735,"usetab":2736,"never":2737,"indentwidth":2738,"columnlimit":2739,"pointers":2740,"derivepointeralignment":2741,"pointeralignment":2742,"left":2743,"reordering":2744,"statements":2745,"introduce":2746,"sortincludes":2747,"choices":2748,"alignconsecutiveassignments":2749,"alignconsecutivedeclarations":2750,"indentppdirectives":2751,"beforehash":2752,"includecategories":2753,"regex":2754,"priority":2755,"llvm":2756,"clang":2757,"mlir":2758,"qoda":2759,"jit":2760,"byte":2761,"dll":2762,"__pycache__":2763,"cod":2764,"cmakeuserpresets":2765,"develop":2766,"eggs":2767,"dist":2768,"lib64":2769,"parts":2770,"var":2771,"egg":2772,"manifest":2773,"pyinstaller":2774,"usually":2775,"exe":2776,"inject":2777,"infos":2778,"installer":2779,"logs":2780,"delete":2781,"unit":2782,"htmlcov":2783,"tox":2784,"nox":2785,"nosetests":2786,"xml":2787,"cover":2788,"hypothesis":2789,"pytest_cache":2790,"mo":2791,"pot":2792,"django":2793,"stuff":2794,"local_settings":2795,"db":2796,"sqlite3":2797,"journal":2798,"flask":2799,"instance":2800,"webassets":2801,"scrapy":2802,"pybuilder":2803,"jupyter":2804,"notebook":2805,"ipynb_checkpoints":2806,"ipython":2807,"profile_default":2808,"ipython_config":2809,"pyenv":2810,"environments":2811,"pipenv":2812,"according":2813,"pypa":2814,"598":2815,"recommended":2816,"pipfile":2817,"collaboration":2818,"poetry":2819,"especially":2820,"reproducibility":2821,"commonly":2822,"ignored":2823,"basic":2824,"poetrylock":2825,"pdm":2826,"stores":2827,"wide":2828,"fming":2829,"ide":2830,"pep":2831,"582":2832,"david":2833,"oconnor":2834,"pyflow":2835,"__pypackages__":2836,"celery":2837,"celerybeat":2838,"schedule":2839,"pid":2840,"sagemath":2841,"parsed":2842,"sage":2843,"bak":2844,"spyder":2845,"spyderproject":2846,"spyproject":2847,"rope":2848,"ropeproject":2849,"site":2850,"mypy_cache":2851,"dmypy":2852,"pyre":2853,"checker":2854,"pytype":2855,"analyzer":2856,"cython":2857,"symbols":2858,"cython_debug":2859,"pycharm":2860,"jetbrains":2861,"gitignore":2862,"nuclear":2863,"option":2864,"uncomment":2865,"entire":2866,"idea":2867,"folder":2868,"vscode":2869,"ds":2870,"store":2871,"ds_store":2872,"csv":2873,"pickle":2874,"pkl":2875,"sphinx":2876,"_build":2877,"vim":2878,"swap":2879,"swo":2880,"swp":2881,"_hip":2882,"hip_compat":2883,"dataset":2884,"actionlint":2885,"marlin_moe":2886,"gen":2887,"ep_kernels_workspace":2888,"default_install_hook_types":2889,"msg":2890,"default_stages":2891,"locally":2892,"yapf":2893,"rev":2894,"43":2895,"args":2896,"place":2897,"failing":2898,"astral":2899,"fix":2900,"crate":2901,"34":2902,"pycqa":2903,"mirrors":2904,"v20":2905,"ggml":2906,"dequantize":2907,"cuh":2908,"vecdotq":2909,"mmq":2910,"mmvq":2911,"types_or":2912,"igorshubovych":2913,"45":2914,"stages":2915,"rhysd":2916,"uv":2917,"strategy":2918,"unsafe":2919,"cu128":2920,"reformat":2921,"nightly_torch_test":2922,"generate_nightly_torch_test":2923,"addi":2924,"tional_dependencies":2925,"mypy_deps":2926,"cachetools":2927,"pyyaml":2928,"awkward":2929,"additional_dependencies":2930,"exports":2931,"excalidraw":2932,"signoff":2933,"grep":2934,"signed":2935,"commit_editmsg":2936,"printf":2937,"nsigned":2938,"fi":2939,"headers":2940,"check_spdx_header":2941,"lazy":2942,"check_init_lazy_imports":2943,"filenames":2944,"ls":2945,"always_run":2946,"pass_filenames":2947,"enforce":2948,"enforce_regex_import":2949,"forbid":2950,"check_triton_import":2951,"cloudpickle":2952,"check_pickle_imports":2953,"pathspec":2954,"validate":2955,"field":2956,"docstring":2957,"validate_config":2958,"test_config":2959,"cli_args":2960,"suggestion":2961,"bypass":2962,"hook":2963,"wit":2964,"insert":2965,"entries":2966,"updates":2967,"maintain":2968,"interval":2969,"labels":2970,"pull":2971,"limit":2972,"reviewers":2973,"khluu":2974,"simon":2975,"torchvision":2976,"xformers":2977,"lm":2978,"enforcer":2979,"compressed":2980,"tensors":2981,"cgraph":2982,"eval":2983,"groups":2984,"pull_request_rules":2985,"label":2986,"tool_parsers":2987,"reasoning":2988,"frontend":2989,"modality":2990,"test_vision":2991,"registry":2992,"qwen":2993,"gpt":2994,"oss":2995,"backends":2996,"_rocm":2997,"structured":2998,"structured_schemas":2999,"benchmark_serving_structured_output":3000,"run_structured_output_benchmark":3001,"structured_outputs":3002,"offline_inference":3003,"online_serving":3004,"openai_chat_completion_structured_outputs":3005,"openai_chat_completion_structured_outputs_with_reasoning":3006,"structured_output":3007,"test_guided_generate":3008,"spec_decode":3009,"mlpspeculator":3010,"eagle":3011,"speculation":3012,"mlp_speculator":3013,"medusa":3014,"_tpu":3015,"tpu_":3016,"pallas":3017,"remo":3018,"tool_use":3019,"mistral_tool_use":3020,"test_chat_with_tool_reasoning":3021,"tool_calling":3022,"tool_chat_":3023,"chat_with_tools":3024,"openai_chat_completion_client_with_tools_required":3025,"openai_chat_completion_tool_calls_with_reasoning":3026,"openai_chat_completion_client_with_tools":3027,"ping":3028,"needs":3029,"rebase":3030,"conflict":3031,"closed":3032,"resolved":3033,"collaborating":3034,"forks":3035,"syncing":3036,"fork":3037,"reviewer":3038,"model_loader":3039,"tensorizer_loader":3040,"test_tensorizer_entrypoint":3041,"sangstar":3042,"open_collective":3043,"help":3044,"articles":3045,"codeowners":3046,"careful":3047,"abstract":3048,"woosukkwon":3049,"zhuohan123":3050,"youkaichao":3051,"alexm":3052,"redhat":3053,"comaniac":3054,"njhill":3055,"llm_engine":3056,"executor_base":3057,"worker_base":3058,"mgoin":3059,"robertgshaw2":3060,"tlrmchlsmth":3061,"yewentao256":3062,"darklight1337":3063,"ywang96":3064,"lucaswilkinson":3065,"jeejeelee":3066,"aarnphm":3067,"zou3519":3068,"proexpertprog":3069,"vllmconfig":3070,"facing":3071,